In [1]:
import numpy as np
import pandas as pd

# DataFrame
A DataFrame in Pandas is like a super-powered Excel table.

Itâ€™s a grid made up of rows and columns where:

Rows = each entry or record (like a student, product, or city)

Columns = categories of data (like name, age, salary, etc.)

In [2]:
 Data = {
     "India" : ['Delhi','Bengaluru','Mumbai', 'Chennai', 'Guwahati','Surat','Leh'],
     "Rank" : [3, 4 ,6, 5, 2, 5, 1],
     "Population" : [20001, 30020, 10000, 13290, 1200, 5000, 1600],
     "Work" : ['Government & IT Services','Technology & Startups','Finance & Entertainment', 'Automobile & Software','Tea Trade & Tourism','Diamond & Textile Industry','Tourism & Army Services']
 }

In [3]:
DF = pd.DataFrame(Data)
DF

       India  Rank  Population                        Work
0      Delhi     3       20001    Government & IT Services
1  Bengaluru     4       30020       Technology & Startups
2     Mumbai     6       10000     Finance & Entertainment
3    Chennai     5       13290       Automobile & Software
4   Guwahati     2        1200         Tea Trade & Tourism
5      Surat     5        5000  Diamond & Textile Industry
6        Leh     1        1600     Tourism & Army Services

# Now I want the indexing of this dataset from 1 not from 0

In [4]:
DF = pd.DataFrame(Data , index = [1,2,3,4,5,6,7])
DF

       India  Rank  Population                        Work
1      Delhi     3       20001    Government & IT Services
2  Bengaluru     4       30020       Technology & Startups
3     Mumbai     6       10000     Finance & Entertainment
4    Chennai     5       13290       Automobile & Software
5   Guwahati     2        1200         Tea Trade & Tourism
6      Surat     5        5000  Diamond & Textile Industry
7        Leh     1        1600     Tourism & Army Services

In [5]:
# Now we haven't given the data in proper format of column than there values

schhl_data = [
    ['ABC School', 1, 1000, 'Delhi'], # We can circle braces(), also the output will be same
    ['DEF School' , 4, 2000, 'Noida'],
    ['MNO School', 2,1300, 'Meerut'],
    ['PQR School', 3 , 2100,'Bengluru'],
    ['XYZ School', 5, 610,'aizwal']
]

#For this we have to use only square braces[], otherwise there will be type error

In [6]:
# If we will run then it will create the columnn header of columns with 0,1,2,3,4,5.....

DF1 = pd.DataFrame(schhl_data)
DF1

            0  1     2         3
0  ABC School  1  1000     Delhi
1  DEF School  4  2000     Noida
2  MNO School  2  1300    Meerut
3  PQR School  3  2100  Bengluru
4  XYZ School  5   610    aizwal

In [7]:
# If we want to change the header or create something.

DF1 = pd.DataFrame(schhl_data, index = [1,2,3,4,5,], columns = ['School Name', 'Rank', 'Fees', 'City'])
DF1

  School Name  Rank  Fees      City
1  ABC School     1  1000     Delhi
2  DEF School     4  2000     Noida
3  MNO School     2  1300    Meerut
4  PQR School     3  2100  Bengluru
5  XYZ School     5   610    aizwal

In [8]:
# If want to write down just one entire column

DF1['School Name']

1    ABC School
2    DEF School
3    MNO School
4    PQR School
5    XYZ School
Name: School Name, dtype: object

In [9]:
# If want to write down any 2,3 entire column

DF1[['School Name','Fees']]

  School Name  Fees
1  ABC School  1000
2  DEF School  2000
3  MNO School  1300
4  PQR School  2100
5  XYZ School   610

# Creating New Column

In [10]:
DF1["Students"] = [122, 321, 432, 243, 232]
DF1

  School Name  Rank  Fees      City  Students
1  ABC School     1  1000     Delhi       122
2  DEF School     4  2000     Noida       321
3  MNO School     2  1300    Meerut       432
4  PQR School     3  2100  Bengluru       243
5  XYZ School     5   610    aizwal       232

Drop function use to delete the whole row or column, but it just remove and show the copy. while the data will remain same in Main Memory. For delete that permanently we have to use inplace = True

# Removing entire column

In [11]:
DF1.drop('Students', axis = 1)

  School Name  Rank  Fees      City
1  ABC School     1  1000     Delhi
2  DEF School     4  2000     Noida
3  MNO School     2  1300    Meerut
4  PQR School     3  2100  Bengluru
5  XYZ School     5   610    aizwal

In [12]:
DF1

  School Name  Rank  Fees      City  Students
1  ABC School     1  1000     Delhi       122
2  DEF School     4  2000     Noida       321
3  MNO School     2  1300    Meerut       432
4  PQR School     3  2100  Bengluru       243
5  XYZ School     5   610    aizwal       232

We can see the Students and e both are in main Data DF1, while now we will use inplace again

In [13]:
DF1.drop('Students', axis = 1, inplace =  True)
DF1

  School Name  Rank  Fees      City
1  ABC School     1  1000     Delhi
2  DEF School     4  2000     Noida
3  MNO School     2  1300    Meerut
4  PQR School     3  2100  Bengluru
5  XYZ School     5   610    aizwal

Now, the Students is permanently delete from the main memory

# Rows
for selecting the row we use loc and iloc functions

In [14]:
DF1.loc[1] #use by telling the location

School Name    ABC School
Rank                    1
Fees                 1000
City                Delhi
Name: 1, dtype: object

In [15]:
DF1.iloc[2] #iloc is use by tell the index location

School Name    MNO School
Rank                    2
Fees                 1300
City               Meerut
Name: 3, dtype: object

In [16]:
#Let print Rank 1,2,3 schools and their cities

DF1.loc[[1, 2 ,3]][['Rank','City']]

   Rank    City
1     1   Delhi
2     4   Noida
3     2  Meerut

# Some Conditional Selections

In [17]:
# Select the school rank less the 3 and in Delhi with there name by using condition

DF1[DF1["Rank"]<3]

  School Name  Rank  Fees    City
1  ABC School     1  1000   Delhi
3  MNO School     2  1300  Meerut

In [18]:
DF1[(DF1["Rank"]<3) & (DF1["City"] == 'Delhi')]

  School Name  Rank  Fees   City
1  ABC School     1  1000  Delhi

# Completed